{
  "messages": [
    "**Welcome to the Stardrop Saloon!**  <:SDVJBpuffer:1051487974551982151>\n\nThis is the dedicated disco dancefloor of the server, where you can roll a few records and share your favourite tracks in a solo music channel.\n\nJoin the <#483784296134606848> voice channel and listen to what's been queued up in chat today. Don't worry, **all users are force-muted in the voice channel**, so it's only music playing!\n\nAdd your music with the commands below and enjoy yourselves!",
    "```ansi\n\u001B[0;0;33mRules and guidelines\n```\n:one:  **All server <#980331531425959996> apply to your posts here.**\n\n:two:  **Don't play offensive music.**\nAvoid playing any music that wouldn't be acceptable if played in-person.\nThis includes politically-loaded songs as well as any particularly explicit music.\n\n:three:  **Don't abuse the jukebox to annoy others.**\nGive others a chance to share and enjoy their music.\nSpamming the queue, playing overly-long tracks, or volume/bass-boosted edits isn't considerate of others. We'll remove your tracks from the queue if you do this.\n\n:warning:  Playlists and songs that would break our rules and guidelines will be removed, and in serious cases you may either lose access to the jukebox or be banned from the server.",
    "```ansi\n\u001B[0;0;33mCommands\n```\n<:SDVJBjukebox:1050964023841128458>  <@986447129801289789> commands start with  `?`\nYou can also use a shortkey instead of their name:\neg.  `?add`   `?q`   `?skip 3`   `?delete 5`   `?wipe rhubarb#4755`   `?w 169338783307792385`\n\n<:SDVJBpam:1051477786008768592>  As a <@&222591661903970304> you're not yet able to use any commands, but you can still join in and listen to what's playing in the saloon!\n:black_small_square:",
    "<:SDVJBvinyl:1050964025690828890>  As a <@&744929308388098068> you can add, remove, and shuffle your own music, and you can remove any queued tracks if you're the only listener:\n\n> [a]  **add**  —  Add a track or playlist to the jukebox queue!\n> You can use `add` without any search terms to start playing the jukebox while in voice.\n> \n> Tracks can be added by URL or keywords:\n> eg. `?add https://www.youtu.be/7L3PO7a1AHQ`   `?a haku hurt world`\n> Playlists can be added by URL only:\n> eg. `?add https://soundcloud.com/dothaku/sets/princess-remedy-2`\n\n> [s]  **skip**  —  Remove the current track, or a given number of tracks.\n> [d]  **delete**  —  Remove one of your tracks at a given position in the queue.\n> [w]  **wipe**  —  Remove all of your own tracks.\n> [f]  **shuffle**  —  Shuffle the order of your own tracks.\n> [q]  **queue**  —  Preview the full jukebox queue.\n> [e]  **current**  —  Preview the current track.\n\n> [u]   **user**  —  Fetch your user info and jukebox stats, or pass a mention or user ID.\n> [j]   **jukebox**  —  Fetch the jukebox usage stats for the server.\n> [i]   **info**  —  Shortcut to point users to pinned messages.\n:black_small_square:",
    "<:SDVJBgold:1050964027427278958>  As a <@&176445608201158657> you're able to use **skip** and **delete** (as normal) or **wipe** (with a mention or user ID) on other users' tracks to start a vote, and you get a couple of new commands, too:\n\n> [l]   **lyrics**  —  Fetch lyrics for any song by keywords, defaults to the current track.\n> [p]  **pause**  —  Pause or resume the jukebox for all listeners at the current track.\n:black_small_square:",
    "<:SDVJBjunimo:1051485985805975592>  As a <@&239770080378880001> your commands bypass voting altogether, and you get a few extra ones to keep the jukebox running:\n\n> [z]  **refresh**  —  Apply command code changes.\n> [x]  **exit**  —  Remove the jukebox from the voice channel.\n> [c]  **cleartracks**  —  Remove all tracks from the jukebox queue.\n> [v]  **clearvotes**  —  End all ongoing votes.\n> [b]  **block**  —  Block all commands from being used.\n> [n]  **unblock**  —  Unblock commands, re-enabling the jukebox.\n> [m] **mango**  —  Activates mango.\n\nBe sure to let staff know by messaging <:SDVJBbouncer:1051514153728217221><@426537100423462914> if someone's abusing the jukebox commands.",
    "```ansi\n\u001B[0;0;33mInformation and support\n```\nIf you've been active in the <#489767000344756274> you can request the <@&976288616215105576> role! Check out the requirements in <#979929386994257940> to see whether you can rock up and rock out with a slick golden role.\n\n<:SDVJBjukebox:1050964023841128458> <@986447129801289789> was made with love for the Stardew Valley community server as the successor to Gus, hosted by <@164945860864507906> for over 3 years.\nComfortable with discord.py? Submit issues and merge requests on our Git page:\n:blueberries:  <https://github.com/StardewValleyDiscord/mini-jukebox>"
  ]
}